app/controllers/movies_controller.rb

  def show
    @id = params[:id] # retrieve movie ID from URI route
    @movie = Movie.find(@id) # look up movie by unique ID
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]

  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(params[:movie])
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "movies" SET "rating" = 'R', "director" = '', "updated_at" = '2013-03-29 16:01:04.239081' WHERE "movies"."id" = 1

  def similar
    @movie = Movie.find params[:movie_id]
    @director = @movie.director
    if @director=="" or @director==nil
      flash[:notice] = "#{@movie.title} has no director"
      redirect_to movies_path
    else
      @movies = Movie.find_all_by_director(@director)
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'George Lucas'